In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('bikebuyer1.csv')
df

,ID,Marital Status,Gender,Yearly Income,Children,Education,Occupation,Home Owner,Cars,Commute Distance,Region,Age,Bike Buyer
0,22711.0,Single,Male,30000,0.0,Partial College,Clerical,No,1,1.0,Europe,33,Yes
1,13555.0,Married,Female,40000,0.0,Graduate Degree,Clerical,Yes,0,1.0,Europe,37,Yes
2,NaN,Married,Male,160000,5.0,Partial College,Professional,No,3,2.0,Europe,55,No
3,2.0,Single,Male,160000,0.0,Graduate Degree,Management,Yes,2,5.0,Pacific,47,No
4,25410.0,NaN,Female,70000,2.0,Bachelors,Skilled Manual,No,1,1.0,North America,38,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6992,22820.0,Married,Male,100000,4.0,High School,Professional,Yes,3,1.0,Europe,52,No
6993,22821.0,Married,Female,130000,4.0,Partial College,Professional,Yes,4,2.0,Europe,52,No
6994,22823.0,Married,Female,160000,5.0,Bachelors,Management,Yes,2,1.0,Europe,53,No
6995,22825.0,Single,Female,120000,5.0,Partial College,Professional,Yes,3,1.0,Europe,54,No
6996,22826.0,Married,Male,130000,5.0,High School,Professional,Yes,3,2.0,Europe,54,No

In [6]:
df['Gender'].replace({'Male':1,'Female':0},inplace= True)
df['Gender'].dtype

dtype('float64')

In [7]:
df.isnull().sum()

ID                   1
Marital Status      16
Gender              29
Yearly Income        0
Children            18
Education            0
Occupation           0
Home Owner           0
Cars                 0
Commute Distance    29
Region               0
Age                  0
Bike Buyer           0
dtype: int64

In [9]:
df['Age'].mean()
# or
print("Mean of age column is",df['Age'].mean())

Mean of age column is 45.10733171359154

In [10]:
# anoter method of calculating mean
sum_of_age = df['Age'].sum()
count_age = df['Age'].count()
mean_age = sum_of_age / count_age
print(mean_age)

45.10733171359154

In [12]:
df['Age'].median()

44.0

In [16]:
df['Age'].mode()

0    42
Name: Age, dtype: int64

In [17]:
df['Age'].max()

96

In [21]:
# another way of calculating the max value
max_age = df['Age'].sort_values(ascending=False).iloc[0]
max_age

96

In [22]:
df['Age'].min()

25

In [23]:
# another way of calculating the min value
max_age = df['Age'].sort_values(ascending=True).iloc[0]
max_age

25

In [24]:
df['Age'].std()

11.91665353557809

In [32]:
#second way
ages = df['Age']
mean_age = df['Age'].mean()
#squared difference
for age in ages:
    diff += [(age-mean_age)**2]
#VARIANCE
variance = np.sum(diff)/len(ages)
#calculate std
std_dev = np.sqrt(variance)
std_dev

11.916276182159386

# groupby()

In [34]:
grp=df[['Age','Yearly Income']].groupby(df['Marital Status'])
grp

In [35]:
grp.head()

    Age  Yearly Income
0    33          30000
1    37          40000
2    55         160000
3    47         160000
5    40         120000
6    49          70000
7    49          60000
9    46          20000
11   49          70000
14   49          90000

In [36]:
grp.mean()

                      Age  Yearly Income
Marital Status
Married         47.933220   61248.487781
Single          41.024228   50832.162921

In [39]:
grp.median()

                 Age  Yearly Income
Marital Status
Married         47.0        60000.0
Single          39.0        40000.0

In [44]:
grp.max()

                Age  Yearly Income
Marital Status
Married          96         170000
Single           93         170000

In [42]:
grp.min()

                Age  Yearly Income
Marital Status
Married          25          10000
Single           25              0

In [43]:
grp.std()

                      Age  Yearly Income
Marital Status
Married         11.681411   32592.699739
Single          11.042997   30238.065912

# Part 2

In [45]:
import seaborn as sns

In [46]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [49]:
df = sns.load_dataset('iris')
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [51]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000